On my recent test with provider AWSCC `1.2.0` , I saw that the behavior has changed a bit.

Terraform plan is no longer triggering replacement, I believe thanks to the fix on #1712, however it still detecting drift
```
  # awscc_kendra_index.example will be updated in-place
  ~ resource "awscc_kendra_index" "example" {
      + capacity_units                       = (known after apply)
        id                                   = "7f069663-4368-44fd-8ac4-745dd11cf43e"
        name                                 = "example-index"
      + server_side_encryption_configuration = (known after apply)
        tags                                 = [
            {
                key   = "Modified By"
                value = "AWSCC"
            },
        ]
      + user_token_configurations            = (known after apply)
        # (7 unchanged attributes hidden)
    }
```

Debug log is telling interesting story:

```
2024-06-28T16:19:25.641-0700 [DEBUG] provider.terraform-provider-awscc_v1.2.0_x5: Detected value change between proposed new state and prior state: tf_attribute_path=document_metadata_configurations tf_resource_type=awscc_kendra_index @caller=github.com/hashicorp/terraform-plugin-framework@v1.9.0/internal/fwserver/server_planresourcechange.go:208 tf_provider_addr=registry.terraform.io/hashicorp/awscc tf_req_id=53bfe62c-85b6-711c-0b02-0c0640c47c83 tf_rpc=PlanResourceChange @module=sdk.framework timestamp=2024-06-28T16:19:25.641-0700
```

Attribute in question: `document_metadata_configurations`